<%@ page pageEncoding="UTF-8" contentType="text/html; charset=UTF-8" isELIgnored="false" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
<%@ taglib uri="http://java.sun.com/jsp/jstl/fmt" prefix="fmt" %>

<div class="container">

    <h2 class="text-center top-space">Простые способы сделать консольную утилиту удобнее</h2>

    <div class="jumbotron top-space">
        <h4>Рассмотрим основные принципы написания удобных консольных приложений.<br><br>

            Качественная командная строка — отличнейшее окружение для работы.
            История, автокомплит, конвейеры, перенаправления, широчайший набор готовых программ,
            возможность скопировать-и-вставить даже самую сложную команду — все это делает
            CLI мощным и удобным инструментом. Ничего удивительного, что разработчики охотно
            пишут собственные консольные программы и скрипты: автоматизация сборки и деплоя,
            разворачивание тестовой БД, статистика, мониторинг, хитроумный поиск — поводов не счесть. <br><br>

            Однако «консольная утилита» не означает автоматически «удобная в использовании утилита».
            Неудачное имя, неполное или отсутствующее описание, большое количество позиционных параметров,
            запутанное именование переключателей — командную строку можно наполнить когнитивным сопротивлением1
            похлеще самого запутанного графического интерфейса.<br><br>

            В этой статье собраны несложные советы, следование которым поможет сделать свои консольные скрипты более
            удобными в работе.</h4>

        <p class="text-right"><a class="btn btn-primary btn-large">Подробнее</a></p>
    </div>
</div>